---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepth
source: html/833abdf0-642c-efe6-c369-dea5c11a0e1c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepth Property

"Structural Depth": Structural Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeStructuralDepth { get; }
```